// 4. Написать функцию вывода текста по заданному шаблону. 
// Функция принимает первым параметром шаблон, в тексте которого может использоваться %,
// после символа % указывается индекс входного параметра.
// При выводе вместо %индекс необходимо вывести значение соответствующего входного параметра.
// Например: 
// print(“Today is %1 %2.%3.%4”, “Monday”, 10, 8, 2020) должна вывести “Today is Monday 10.8.2020”.

function printf(template, ...values) {
    return template.replace(/%(\d+)/g, (str, num) => [...values][num - 1]);
  }
  console.log(printf("Today is %1 %2.%3.%4", "Monday", 10, 8, 2020));
  