// 1. Запросить 2 числа и найти только наибольший общий делитель.
// НОД (30, 18) = 6
// let num1 = prompt("Введите 1 число:");
// let num2 = prompt("Введите 2 число:");
// let a = num1;
// let b = num2;
// var q = a % b
// while (q != 0) {
//     a = b
//     b = q
//     q = a % b
// }
// alert('НОД (' + num1 + ', ' + num2 + ') = ' + b)

// 2. Запросить у пользователя 10 чисел и подсчитать, 
// сколько он ввел положительных, отрицательных и нулей. 
// При этом также посчитать, сколько четных и нечетных.
// Вывести статистику на экран. Учтите, что достаточно 
// одной переменной (не 10) для ввода чисел пользователем.
// let positive = 0;
// let negative = 0;
// let zero = 0;
// for(let i = 0; i < 10; i++)
// {
//     let n = Number(prompt('Введите ' + (i+1) + ' число из 10:'))
//     if (n > 0) 
//         positive++;
//     else if(n < 0)
//         negative++;
//     else 
//         zero++;
// }
// alert('Было введено:'+
// '\nПоложительных чисел = ' + positive + 
// '\nОтрицательных чисел = ' + negative +
// '\nНулей = ' + zero)

// 3. Запросить у пользователя число и на сколько цифр его сдвинуть.
// Сдвинуть цифры числа и вывести результат
// (если число 123456 сдвинуть на 2 цифры, то получится 345612)
// let num = prompt('Введите (123456) число:');
// let shift = Number(prompt('Введите на сколько цифр (2) его сдвинуть:'));
// let first_part = num.slice(0, shift);
// let second_part = num.slice(shift);
// alert('Введенное число -> ' + num +
//     '\nПосле сдвига на -> ' + shift + ' цифры' +
//     '\nБудет следущее: ' + second_part + first_part)

// 4. Игра «Угадай число». 
// Предложить пользователю загадать число от 0 до 100 и отгадать его следующим способом:
// каждую итерацию цикла делите диапазон чисел пополам, 
// записываете результат в N и спрашиваете у пользователя «Ваше число > N, < N или == N?».
// В зависимости от того что указал пользователь, уменьшаете диапазон.
// Начальный диапазон от 0 до 100, поделили пополам и получили 50.
// Если пользователь указал, что его число > 50, то изменили диапазон на от 51 до 100.
// И так до тех пор, пока пользователь не выберет == N.
alert('Загадайте число число от 0 до 100');
let head = 0;
let tail = 101;
while (true) {

    let N = Math.floor((head + tail) / 2);

    let result = prompt('Число Больше ' + N + ', Меньше ' + N + ', или Равно ' + N + ' ?');

    if (result == 'Больше') {
        head = N;
    } else if (result == 'Меньше') {
        tail = N;
    } else if (result == 'Равно') {
        alert('Число отгадано!!! \nВы загадали число -> ' + N);
        break;
    } else {
        alert('Ошибочный ввод!!!\nВводите:\nБольше или Меньше или Равно.')
    }
}
